### 오라클 _ 라이브러리 연동
    - oxOracle 연동

In [1]:
# !pip install cx_Oracle

Requirement already satisfied: cx_Oracle in c:\users\smhrd\anaconda3\lib\site-packages (8.3.0)

In [2]:
import cx_Oracle

un = "hr"
pw = "12345"
# dsn = 주소:포토/DB명
dsn = "Localhost:1521/xe"

# try except ~ : 예외처리
# 예외처리 : 논리적인 문제가 아닌 실행중에 발새하는 오류를 처리하기위한 것
# ex) 숫자입력에 문자를 입력하거나, 0으로 나누거나, 통신이 끊어지거나
# try문에서 예외가 발생하면 except 문을 실행


try :
    # DB연결객체 - DB연결과 관련된 정보를 가지고 있음
    conn = cx_Oracle.connect(un, pw, dsn)
    print("DB 접속 성공")
    # DatabaseError : 데이터베이스 사용시 발생하는 오류의 종류 관리
except cx_Oracle.DatabaseError as e:
    print("DB 접속 실패")
    # 오류 내용을 출력
    print(e)

DB 접속 성공

- 커서(cursor) 객체 : 데이터를 송수신하는 역할
    - 연결객체에 선언
    - 서비스 단에서 이력된 query 문을 DB로 전달하는 역할
    - DB서버에서 query문으로 실행된 결과를 서비스단으로 전송하는 역할(select문 실행)

In [3]:
cur = conn.cursor()

# 구현내용
- 테이블 생성
- 테이블 데이터 저장
- 테이블 데이터 변경
- 테이블 데이터 삭제
- 테이블 데이터 검색
- DB 접속 종료

In [3]:
query = """create table member_tbl(
    code varchar(10) primary key,
    name varchar(10) not null,
    id varchar(10) not null,
    pw varchar(10) not null
)"""

- query문의 형태
    - execute() : 커서 객체에 있는 query문을 싱행해주는 기능
    - 실행만 하고 반환값이 없는 형태
        - DB값을 변경하는 경우 연결객체에 있는 commit() 함수 반드시 실행해주어야 적용
    - 실행 후에 반환값이 있는 형태(select)
        - 결과값을 받아서 되돌려주어야함
        - fetchall() : 모든 결과값을 반환 (커서객체에 있음)
        - fetchone() : 하나의 결과값만 반환 (커서객체에 있음)

In [7]:
# 테이블 생성
try :
    cur.execute(query)
    conn.commit()
except cx_Oracle.DatabaseError as e :
    print("테이블 생성 실패")
    print(e)

테이블 생성 실패
ORA-00955: name is already used by an existing object

In [9]:
# 테이블 검색
query = "select * from tabs"

try:
    cur.execute(query)
    print(cur.fetchall())
except cx_Oracle.DatabaseError as e:
    print("테이블 검색 실패")
    print(e)

[('TEST_성적표', 'USERS', None, None, 'VALID', 10, None, 1, 255, 65536, 1048576, 1, 2147483645, None, None, None, 'YES', 'N', 0, 0, 0, 0, 0, 0, 0, 0, '         1', '         1', '    N', 'ENABLED', 0, datetime.datetime(2024, 4, 12, 13, 42, 16), 'NO', None, 'N', 'N', 'NO', 'DEFAULT', 'DEFAULT', 'DEFAULT', 'DISABLED', 'YES', 'NO', None, 'DISABLED', 'YES', None, 'DISABLED', 'DISABLED', None, 'NO', 'NO', 'YES', 'DEFAULT'), ('TB_TEST1', 'USERS', None, None, 'VALID', 10, None, 1, 255, 65536, 1048576, 1, 2147483645, None, None, None, 'YES', 'N', 0, 0, 0, 0, 0, 0, 0, 0, '         1', '         1', '    N', 'ENABLED', 0, datetime.datetime(2024, 4, 12, 13, 42, 16), 'NO', None, 'N', 'N', 'NO', 'DEFAULT', 'DEFAULT', 'DEFAULT', 'DISABLED', 'YES', 'NO', None, 'DISABLED', 'YES', None, 'DISABLED', 'DISABLED', None, 'NO', 'NO', 'YES', 'DEFAULT'), ('TB_TEST2', 'USERS', None, None, 'VALID', 10, None, 1, 255, 65536, 1048576, 1, 2147483645, None, None, None, 'YES', 'N', 0, 0, 0, 0, 0, 0, 0, 0, '         1', '         1', '    N', 'ENABLED', 0, datetime.datetime(2024, 4, 12, 13, 42, 16), 'NO', None, 'N', 'N', 'NO', 'DEFAULT', 'DEFAULT', 'DEFAULT', 'DISABLED', 'YES', 'NO', None, 'DISABLED', 'YES', None, 'DISABLED', 'DISABLED', None, 'NO', 'NO', 'YES', 'DEFAULT'), ('LOGIN_TABLE', 'USERS', None, None, 'VALID', 10, None, 1, 255, 65536, 1048576, 1, 2147483645, None, None, None, 'YES', 'N', 0, 0, 0, 0, 0, 0, 0, 0, '         1', '         1', '    N', 'ENABLED', 0, datetime.datetime(2024, 4, 12, 13, 42, 16), 'NO', None, 'N', 'N', 'NO', 'DEFAULT', 'DEFAULT', 'DEFAULT', 'DISABLED', 'YES', 'NO', None, 'DISABLED', 'YES', None, 'DISABLED', 'DISABLED', None, 'NO', 'NO', 'YES', 'DEFAULT'), ('DROP_성적표', 'USERS', None, None, 'VALID', 10, None, 1, 255, 65536, 1048576, 1, 2147483645, None, None, None, 'YES', 'N', 18, 4, 0, 0, 0, 17, 0, 0, '         1', '         1', '    N', 'ENABLED', 18, datetime.datetime(2024, 4, 12, 13, 42, 16), 'NO', None, 'N', 'N', 'NO', 'DEFAULT', 'DEFAULT', 'DEFAULT', 'DISABLED', 'YES', 'NO', None, 'DISABLED', 'YES', None, 'DISABLED', 'DISABLED', None, 'NO', 'NO', 'YES', 'DEFAULT'), ('HY_SONGLIST', 'USERS', None, None, 'VALID', 10, None, 1, 255, 65536, 1048576, 1, 2147483645, None, None, None, 'YES', 'N', 0, 5, 0, 0, 0, 0, 0, 0, '         1', '         1', '    N', 'ENABLED', 0, datetime.datetime(2024, 4, 12, 13, 42, 16), 'NO', None, 'N', 'N', 'NO', 'DEFAULT', 'DEFAULT', 'DEFAULT', 'DISABLED', 'YES', 'NO', None, 'DISABLED', 'YES', None, 'DISABLED', 'DISABLED', None, 'NO', 'NO', 'YES', 'DEFAULT'), ('MEMBER_JOIN', 'USERS', None, None, 'VALID', 10, None, 1, 255, 65536, 1048576, 1, 2147483645, None, None, None, 'YES', 'N', 2, 5, 0, 0, 0, 65, 0, 0, '         1', '         1', '    N', 'ENABLED', 2, datetime.datetime(2024, 4, 19, 12, 0, 5), 'NO', None, 'N', 'N', 'NO', 'DEFAULT', 'DEFAULT', 'DEFAULT', 'DISABLED', 'YES', 'NO', None, 'DISABLED', 'YES', None, 'DISABLED', 'DISABLED', None, 'NO', 'NO', 'YES', 'DEFAULT'), ('REGIONS', 'USERS', None, None, 'VALID', 10, None, 1, 255, 65536, 1048576, 1, 2147483645, None, None, None, 'YES', 'N', 4, 5, 0, 0, 0, 14, 0, 0, '         1', '         1', '    N', 'ENABLED', 4, datetime.datetime(2014, 5, 29, 13, 21, 56), 'NO', None, 'N', 'N', 'NO', 'DEFAULT', 'DEFAULT', 'DEFAULT', 'DISABLED', 'YES', 'NO', None, 'DISABLED', 'YES', None, 'DISABLED', 'DISABLED', None, 'NO', 'NO', 'YES', 'DEFAULT'), ('COUNTRIES', None, None, None, 'VALID', 0, 0, 0, 0, None, None, None, None, None, None, None, None, 'N', 25, None, None, None, 0, 15, 0, None, '         1', '         1', '    N', 'ENABLED', 25, datetime.datetime(2014, 5, 29, 13, 21, 55), 'NO', 'IOT', 'N', 'N', 'NO', 'DEFAULT', 'DEFAULT', 'DEFAULT', 'DISABLED', 'YES', 'NO', None, 'DISABLED', 'YES', None, 'DISABLED', 'DISABLED', 'BASIC', 'NO', 'NO', 'YES', 'DEFAULT'), ('LOCATIONS', 'USERS', None, None, 'VALID', 10, None, 1, 255, 65536, 1048576, 1, 2147483645, None, None, None, 'YES', 'N', 23, 5, 0, 0, 0, 49, 0, 0, '         1', '         1', '    N', 'ENABLED', 23, datetime.datetime(2014, 5, 29, 13, 21, 56), 'NO', None, 'N', 'N', 'NO', 'DEFAULT', 'DEFAULT', 'DEFAULT', 'DISABLED', 'YES', 'NO', None, 'DISABLED', 'YES', None, 'DISABLED', 'DISABLED', None, 'NO', 'NO', 'YES', 'DEFAULT'), ('DEPARTMENTS', 'USERS', None, None, 'VALID', 10, None, 1, 255, 65536, 1048576, 1, 2147483645, None, None, None, 'YES', 'N', 27, 5, 0, 0, 0, 21, 0, 0, '         1', '         1', '    N', 'ENABLED', 27, datetime.datetime(2014, 5, 29, 13, 21, 55), 'NO', None, 'N', 'N', 'NO', 'DEFAULT', 'DEFAULT', 'DEFAULT', 'DISABLED', 'YES', 'NO', None, 'DISABLED', 'YES', None, 'DISABLED', 'DISABLED', None, 'NO', 'NO', 'YES', 'DEFAULT'), ('JOBS', 'USERS', None, None, 'VALID', 10, None, 1, 255, 65536, 1048576, 1, 2147483645, None, None, None, 'YES', 'N', 19, 5, 0, 0, 0, 33, 0, 0, '         1', '         1', '    N', 'ENABLED', 19, datetime.datetime(2014, 5, 29, 13, 21, 55), 'NO', None, 'N', 'N', 'NO', 'DEFAULT', 'DEFAULT', 'DEFAULT', 'DISABLED', 'YES', 'NO', None, 'DISABLED', 'YES', None, 'DISABLED', 'DISABLED', None, 'NO', 'NO', 'YES', 'DEFAULT'), ('EMPLOYEES', 'USERS', None, None, 'VALID', 10, None, 1, 255, 65536, 1048576, 1, 2147483645, None, None, None, 'YES', 'N', 107, 5, 0, 0, 0, 69, 0, 0, '         1', '         1', '    N', 'ENABLED', 107, datetime.datetime(2014, 5, 29, 13, 21, 55), 'NO', None, 'N', 'N', 'NO', 'DEFAULT', 'DEFAULT', 'DEFAULT', 'DISABLED', 'YES', 'NO', None, 'DISABLED', 'YES', None, 'DISABLED', 'DISABLED', None, 'NO', 'NO', 'YES', 'DEFAULT'), ('JOB_HISTORY', 'USERS', None, None, 'VALID', 10, None, 1, 255, 65536, 1048576, 1, 2147483645, None, None, None, 'YES', 'N', 10, 5, 0, 0, 0, 31, 0, 0, '         1', '         1', '    N', 'ENABLED', 10, datetime.datetime(2014, 5, 29, 13, 21, 56), 'NO', None, 'N', 'N', 'NO', 'DEFAULT', 'DEFAULT', 'DEFAULT', 'DISABLED', 'YES', 'NO', None, 'DISABLED', 'YES', None, 'DISABLED', 'DISABLED', None, 'NO', 'NO', 'YES', 'DEFAULT'), ('수강생정보', 'USERS', None, None, 'VALID', 10, None, 1, 255, 65536, 1048576, 1, 2147483645, None, None, None, 'YES', 'N', 9, 5, 0, 0, 0, 19, 0, 0, '         1', '         1', '    N', 'ENABLED', 9, datetime.datetime(2024, 4, 12, 13, 42, 16), 'NO', None, 'N', 'N', 'NO', 'DEFAULT', 'DEFAULT', 'DEFAULT', 'DISABLED', 'YES', 'NO', None, 'DISABLED', 'YES', None, 'DISABLED', 'DISABLED', None, 'NO', 'NO', 'YES', 'DEFAULT'), ('성적표', 'USERS', None, None, 'VALID', 10, None, 1, 255, 65536, 1048576, 1, 2147483645, None, None, None, 'YES', 'N', 18, 5, 0, 0, 0, 17, 0, 0, '         1', '         1', '    N', 'ENABLED', 18, datetime.datetime(2024, 4, 12, 13, 42, 16), 'NO', None, 'N', 'N', 'NO', 'DEFAULT', 'DEFAULT', 'DEFAULT', 'DISABLED', 'YES', 'NO', None, 'DISABLED', 'YES', None, 'DISABLED', 'DISABLED', None, 'NO', 'NO', 'YES', 'DEFAULT'), ('TCL_수강생정보', 'USERS', None, None, 'VALID', 10, None, 1, 255, 65536, 1048576, 1, 2147483645, None, None, None, 'YES', 'N', 9, 8, 0, 0, 0, 19, 0, 0, '         1', '         1', '    N', 'ENABLED', 9, datetime.datetime(2024, 4, 19, 12, 0, 3), 'NO', None, 'N', 'N', 'NO', 'DEFAULT', 'DEFAULT', 'DEFAULT', 'DISABLED', 'YES', 'NO', None, 'DISABLED', 'YES', None, 'DISABLED', 'DISABLED', None, 'NO', 'NO', 'YES', 'DEFAULT'), ('DB_SEQUENCE', 'USERS', None, None, 'VALID', 10, None, 1, 255, 65536, 1048576, 1, 2147483645, None, None, None, 'YES', 'N', 11, 5, 0, 0, 0, 37, 0, 0, '         1', '         1', '    N', 'ENABLED', 11, datetime.datetime(2024, 4, 19, 12, 0, 3), 'NO', None, 'N', 'N', 'NO', 'DEFAULT', 'DEFAULT', 'DEFAULT', 'DISABLED', 'YES', 'NO', None, 'DISABLED', 'YES', None, 'DISABLED', 'DISABLED', None, 'NO', 'NO', 'YES', 'DEFAULT'), ('DEPT', 'USERS', None, None, 'VALID', 10, None, 1, 255, 65536, 1048576, 1, 2147483645, None, None, None, 'YES', 'N', 0, 0, 0, 0, 0, 0, 0, 0, '         1', '         1', '    N', 'ENABLED', 0, datetime.datetime(2024, 4, 19, 12, 0, 3), 'NO', None, 'N', 'N', 'NO', 'DEFAULT', 'DEFAULT', 'DEFAULT', 'DISABLED', 'YES', 'NO', None, 'DISABLED', 'YES', None, 'DISABLED', 'DISABLED', None, 'NO', 'NO', 'YES', 'DEFAULT'), ('EMP', 'USERS', None, None, 'VALID', 10, None, 1, 255, 65536, 1048576, 1, 2147483645, None, None, None, 'YES', 'N', 0, 0, 0, 0, 0, 0, 0, 0, '         1', '         1', '    N', 'ENABLED', 0, datetime.datetime(2024, 4, 19, 12, 0, 3), 'NO', None, 'N', 'N', 'NO', 'DEFAULT', 'DEFAULT', 'DEFAULT', 'DISABLED', 'YES', 'NO', None, 'DISABLED', 'YES', None, 'DISABLED', 'DISABLED', None, 'NO', 'NO', 'YES', 'DEFAULT'), ('MEMBER_TBL', 'USERS', None, None, 'VALID', 10, None, 1, 255, 65536, 1048576, 1, 2147483645, None, None, None, 'YES', 'N', None, None, None, None, None, None, None, None, '         1', '         1', '    N', 'ENABLED', None, None, 'NO', None, 'N', 'N', 'NO', 'DEFAULT', 'DEFAULT', 'DEFAULT', 'DISABLED', 'NO', 'NO', None, 'DISABLED', 'YES', None, 'DISABLED', 'DISABLED', None, 'NO', 'NO', 'YES', 'DEFAULT')]

#### 데이터 저장하기

In [19]:
query = "insert into member_tbl values ('A003','댕댕이', 'c123','12345')"

try:
    cur.execute(query)
    conn.commit()
    print("저장성공")

except cx_Oracle.DatabaseError as e:
    print("데이터 저장 불가")
    print(e)

저장성공

In [4]:
code = input("CODE 입력:ex)A001")
name = input("name 입력:ex)홍길동")
id = input("id 입력:ex)a123")
pw = input("pw 입력:ex)12345")

In [21]:
# 개발 시에 값이 추가된 쿼리문의 확인이 필요한 경우에 주로 사용
# 값 입력받기


code = input("CODE 입력:ex)A001")
n_val = input("name 입력:ex)홍길동")
id_val = input("id 입력:ex)a123")
pw_val = input("pw 입력:ex)12345")

query = f"insert into member_tbl values ('{code}','{n_val}','{id_val}','{pw_val}')"

print(query)
try:
    cur.execute(query)
    conn.commit()
    print("저장성공")

except cx_Oracle.DatabaseError as e:
    print("데이터 저장 불가")
    print(e)

저장성공

- 값을 쿼리문에 자동으로 할당해서 쿼리문을 완성
- 중간 쿼리문을 확인할 수 없음
- 다양한 쿼리문을 생성할 수 있음.

- 사용자가 입력한 값들을 딕셔너리에 저장한 다음 딕셔너리의 key값으로 커서객체가  
  쿼리문에 값들을 할당해서 query문을 완성하고 실행

In [22]:
code = input("CODE 입력:ex)A001")
n_val = input("name 입력:ex)홍길동")
id_val = input("id 입력:ex)a123")
pw_val = input("pw 입력:ex)12345")

# 입력한 값들을 딕셔너리에 저장
input_data = {"code":code,"name":n_val,"id":id_val,"pw":pw_val}

# 쿼리문 작성 (값들이 할당될 위치를 키값으로 설정)
# 문자열의 경우 따옴표는 자동으로 부여
query = "insert into member_tbl values (:code,:name,:id,:pw)"

try:
    # 입력값들을 할당해서 쿼리문을 완성하고 실행
    cur.execute(query,input_data)
    conn.commit()
    print("저장성공")

except cx_Oracle.DatabaseError as e:
    print("데이터 저장 불가")
    print(e)

저장성공

- 데이터 검색

In [24]:
query = "select * from member_tbl"

try:
    cur.execute(query)
    row = cur.fetchall()
    display(row)

except cx_Oracle.DatabaseError as e:
    print("검색 실패")
    print(e)

[('A001', '홍길동', 'a123', '12345'),
 ('A002', '마당쇠', 'b123', '12345'),
 ('A003', '댕댕이', 'c123', '12345'),
 ('A004', '김현우', 'a126', '23456'),
 ('C001', '김유신', 'C123', '13579')]

- 검색 결과를 데이터 프레임으로 출력

In [28]:
import pandas as pd
columns = ["code","name","id","pw"]
df = pd.DataFrame(row, columns=columns)

In [29]:
df

   code name    id     pw
0  A001  홍길동  a123  12345
1  A002  마당쇠  b123  12345
2  A003  댕댕이  c123  12345
3  A004  김현우  a126  23456
4  C001  김유신  C123  13579

- 코드를 입력받아서 입력받은 코드로 데이터를 검색하는 기능 구현
    - 코드를 입력 받음.
    - 입력받은 코드를 딕셔너리에 저장
    - 딕셔너리 키를 갖는 query문 선언
    - execute() 문으로 쿼리문에 키값을 할당하고 실행
    - 검색 결과를 fetchone()으로 받아서 출력

In [32]:
code = input("코드 입력:")
input_data = {"code":code}
query = "select * from member_tbl where code = (:code)"


try:
    cur.execute(query,input_data)
    row = cur.fetchone()
    display(row)

except cx_Oracle.DatabaseError as e:
    print("검색 실패")
    print(e)

('A001', '홍길동', 'a123', '12345')

#### 데이터 변경
- 해당 코드의 데이터를 재입력 (코드는 제외)
- 딕셔너리로 저장
- query문 생성
- cursor로 딕셔너리에 저장된 데이터를 query문에 적용해서 실행
- 변경 결과를 출력

In [ ]:
# 코드입력시 데이터 검색
code = input("코드 입력:")
input_data = {"code":code}


query = "select * from member_tbl where code = :code"



try:
    cur.execute(query,input_data)
    row = cur.fetchone()
    display(row)

except cx_Oracle.DatabaseError as e:
    print("검색 실패")
    print(e)

In [9]:
# 변경전 데이터 검색
code = input("코드 입력:")
input_data = {"code":code}


query = "select * from member_tbl where code = :code"

try:
    cur.execute(query,input_data)
    row = cur.fetchone()
    display(row)

except cx_Oracle.DatabaseError as e:
    print("검색 실패")
    print(e)

# 해당 코드의 데티어 재입력
n_val = input("변경할 name :ex)홍길동")
id_val = input("변경할 id :ex)a123")
pw_val = input("변경할 pw :ex)12345")

# 입력한 값들을 딕셔너리에 저장
input_data = {"code":code,"name":n_val,"id":id_val,"pw":pw_val}
query = "update member_tbl set name=:name, id=:id, pw=:pw where code=:code"

try:
    cur.execute(query,input_data)
    conn.commit()
    print("변경 성공")
    

except cx_Oracle.DatabaseError as e:
    print("검색 실패")
    print(e)

# 변경결과를 출력
input_data = {"code":code}


query = "select * from member_tbl where code = :code"

try:
    cur.execute(query,input_data)
    row = cur.fetchone()
    display(row)

except cx_Oracle.DatabaseError as e:
    print("검색 실패")
    print(e)

('A004', '김현우', 'a126', '23456')

변경 성공

('A004', '홍길동', 'D123', '56789')

### 데이터 삭제

In [21]:
# 변경전 데이터 검색
code = input("코드 입력:")
input_data = {"code":code}

query = "select * from member_tbl where code = :code"

try:
    cur.execute(query,input_data)
    row = cur.fetchone()
    display(row)

except cx_Oracle.DatabaseError as e:
    print("검색 실패")
    print(e)


# 삭제할 데이터 입력
query = "delete from member_tbl where code=:code"

try:
    cur.execute(query,input_data)
    conn.commit()
    print("삭제 성공")
except cx_Oracle.DatabaseError as e:
    print("삭제 실패")
    print(e)

# 삭제 이후 검색

query = "select * from member_tbl"
import pandas as pd
try:
    cur.execute(query)
    row = pd.DataFrame(cur.fetchall(),columns=["code","name","id","pw"])
    display(row)

except cx_Oracle.DatabaseError as e:
    print("검색 실패")
    print(e)

None

삭제 성공

   code name    id     pw
0  A001  홍길동  a123  12345
1  A002  마당쇠  b123  12345
2  A003  댕댕이  c123  12345
3  A004  홍길동  D123  56789

### 데이터베이스 연결 종료
- 커서객체 종료
- 연결객체 종료
- 데이터베이스 종료

In [22]:
cur.close()
conn.close()

#### DB 연동 관련 기능들을 모듈로 제작

In [4]:
%%writefile DB_Control.py
import cx_Oracle

# DB연결
def db_conn(user_name,passward,dsn):
    try:
        #연결객체 생성
        conn = cx_Oracle.connect(user_name,passward,dsn)
        #연결객체에 커서 객체를 생성
        cur = conn.cursor()
        print("DB연결 성공")
    except cx_Oracle.DatabaseError as e:
        print("DB연결 실패")

    #다른함수에서 사용하도록 cur,conn return    
    return conn, cur

# DB연결 종료
def db_disconn(conn, cur):
    cur.close()
    conn.close()
    print("DB연동 종료")

# 테이블생성
def create_tbl(conn,cur,query):
    try :
        cur.execute(query)
        conn.commit()
        print("테이블 생성")
    except cx_Oracle.DatabaseError as e :
        print("테이블 생성 실패")
        print(e)
        

# 데이터 저장
# t_name : 테이블명
# dic : 입력 데이터를 저장하고 있는 딕셔너리
def insert_data(conn,cur,t_name,dic):

    query = f"insert into {t_name} values ("
    
    # 딕셔너리에 저장된 데이터의 수에 맞게 저장 데이터를 설정하는 query문
    # 딕셔너이에서 키값들을 하나씩 읽어와서 쿼리문을 작성
    # dic = {"id":"a1111","pw":"12345","name":"홍길동"}
    # -> insert into Login_tbl2 values (:id,:pw,:name)
    for key in dic.keys():
        query += f":{key},"

    # 마지막 (,)를 제거하고, )를 추가
    # > :id,:pw,:name)
    query = query.rstrip(",")
    query += ")"

    try :
        cur.execute(query, dic)
        conn.commit()
        print("데이터 저장 성공")
    except cx_Oracle.DatabaseError as e:
        print("저장 실패")
        print(e)
        
# 전체 데이터 검색
def search_all(cur,t_name):
    query = f"select * from {t_name}"

    try:
        cur.execute(query)
        return cur.fetchall()
    except cx_Oracle.DatabaseError as e:
        print("검색 실패")
        print(e)

# 1개 데이터 검색
def search_one(cur,t_name,col,val):
    query = f"select * from {t_name} where {col}='{val}'"
    
    try:
        cur.execute(query)
        return cur.fetchone()

    except cx_Oracle.DatabaseError as e:
        print("검색 실패")
        print(e)



# 데이터 수정
def update_data(conn,cur,t_name,dic,col,val):
    #update login_tbl2 set
    query = f"update {t_name} set "
    
    #id=:id, pw=:pw, name=:name,
    for key in dic.keys():
        query+=f"{key}=:{key},"

    #id=:id, pw=:pw, name=:name
    query = query.rstrip(',')
    
    # where col='val'
    query += f" where {col}='{val}'"

    try:
        cur.execute(query,dic)
        conn.commit()
        print("수정 완료")        

    except cx_Oracle.DatabaseError as e:
        print("수정 실패")
        print(e)

# 데이터삭제

def delete_data(conn,cur,t_name,col,val):
    query = f"delete from {t_name} where {col}='{val}'"
    
    try:
        cur.execute(query)
        conn.commit()
        print("삭제 성공")
    except cx_Oracle.DatabaseError as e:
        print("삭제 실패")
        print(e)

Overwriting DB_Control.py

### 모듈테스트

In [2]:
import DB_Control as dc

#DB연결
conn,cur = dc.db_conn("hr","12345","Localhost:1521/xe")

DB연결 성공

In [9]:
query = """ create table login_tbl2(
id varchar(10) primary key,
pw varchar(10) not null,
name varchar(10) not null)"""
dc.create_tbl(conn,cur,query)

테이블 생성 실패
ORA-00955: name is already used by an existing object

In [7]:
# 데이터 저장
id_val = input("아이디 입력:")
pw_val = input("비밀번호 입력:")
na_val = input("이름 입력:")

dic = {"id":id_val,"pw":pw_val,"name":na_val}
dc.insert_data(conn,cur,"login_tbl2",dic)

데이터 저장 성공

In [4]:
#DB 전체 검색
import pandas as pd
dc.search_all(cur,"login_tbl2")
display(pd.DataFrame(dc.search_all(cur,"login_tbl2"),columns=["아이디","비밀번호","이름"]))

     아이디   비밀번호   이름
0  A1112  23456  고길동
1  A0001  12345  홍길동
2  A0003  34567  김유신

In [3]:
#DB 1개 데이터 검색
id_val = input("아이디입력:")
display(dc.search_one(cur,"login_tbl2","id",id_val))

select * from login_tbl2 where id='A1112'

('A1112', '23456', '고길동')

In [3]:
#데이터 수정

id_val = input("아이디입력")
pw_val = input("패스워드입력")
name_val = input("이름입력")



input_data = {"id":id_val,"pw":pw_val,"name":name_val}
dc.update_data(conn,cur,"login_tbl2",input_data,"id",id_val)

수정 완료

In [ ]:
#DB 종료
dc.db_disconn(conn,cur)